; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p3---int100n150-m25---int100c110---s20---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level11 level11)
(sum level0 level14 level14)
(sum level0 level17 level17)
(sum level0 level20 level20)
(sum level0 level25 level25)
(sum level1 level5 level6)
(sum level1 level11 level12)
(sum level1 level14 level15)
(sum level1 level17 level18)
(sum level1 level20 level21)
(sum level1 level25 level26)
(sum level2 level5 level7)
(sum level2 level11 level13)
(sum level2 level14 level16)
(sum level2 level17 level19)
(sum level2 level20 level22)
(sum level2 level25 level27)
(sum level3 level5 level8)
(sum level3 level11 level14)
(sum level3 level14 level17)
(sum level3 level17 level20)
(sum level3 level20 level23)
(sum level3 level25 level28)
(sum level4 level5 level9)
(sum level4 level11 level15)
(sum level4 level14 level18)
(sum level4 level17 level21)
(sum level4 level20 level24)
(sum level4 level25 level29)
(sum level5 level5 level10)
(sum level5 level11 level16)
(sum level5 level14 level19)
(sum level5 level17 level22)
(sum level5 level20 level25)
(sum level5 level25 level30)
(sum level6 level5 level11)
(sum level6 level11 level17)
(sum level6 level14 level20)
(sum level6 level17 level23)
(sum level6 level20 level26)
(sum level6 level25 level31)
(sum level7 level5 level12)
(sum level7 level11 level18)
(sum level7 level14 level21)
(sum level7 level17 level24)
(sum level7 level20 level27)
(sum level7 level25 level32)
(sum level8 level5 level13)
(sum level8 level11 level19)
(sum level8 level14 level22)
(sum level8 level17 level25)
(sum level8 level20 level28)
(sum level8 level25 level33)
(sum level9 level5 level14)
(sum level9 level11 level20)
(sum level9 level14 level23)
(sum level9 level17 level26)
(sum level9 level20 level29)
(sum level9 level25 level34)
(sum level10 level5 level15)
(sum level10 level11 level21)
(sum level10 level14 level24)
(sum level10 level17 level27)
(sum level10 level20 level30)
(sum level10 level25 level35)
(sum level11 level5 level16)
(sum level11 level11 level22)
(sum level11 level14 level25)
(sum level11 level17 level28)
(sum level11 level20 level31)
(sum level11 level25 level36)
(sum level12 level5 level17)
(sum level12 level11 level23)
(sum level12 level14 level26)
(sum level12 level17 level29)
(sum level12 level20 level32)
(sum level12 level25 level37)
(sum level13 level5 level18)
(sum level13 level11 level24)
(sum level13 level14 level27)
(sum level13 level17 level30)
(sum level13 level20 level33)
(sum level13 level25 level38)
(sum level14 level5 level19)
(sum level14 level11 level25)
(sum level14 level14 level28)
(sum level14 level17 level31)
(sum level14 level20 level34)
(sum level14 level25 level39)
(sum level15 level5 level20)
(sum level15 level11 level26)
(sum level15 level14 level29)
(sum level15 level17 level32)
(sum level15 level20 level35)
(sum level15 level25 level40)
(sum level16 level5 level21)
(sum level16 level11 level27)
(sum level16 level14 level30)
(sum level16 level17 level33)
(sum level16 level20 level36)
(sum level16 level25 level41)
(sum level17 level5 level22)
(sum level17 level11 level28)
(sum level17 level14 level31)
(sum level17 level17 level34)
(sum level17 level20 level37)
(sum level17 level25 level42)
(sum level18 level5 level23)
(sum level18 level11 level29)
(sum level18 level14 level32)
(sum level18 level17 level35)
(sum level18 level20 level38)
(sum level18 level25 level43)
(sum level19 level5 level24)
(sum level19 level11 level30)
(sum level19 level14 level33)
(sum level19 level17 level36)
(sum level19 level20 level39)
(sum level19 level25 level44)
(sum level20 level5 level25)
(sum level20 level11 level31)
(sum level20 level14 level34)
(sum level20 level17 level37)
(sum level20 level20 level40)
(sum level20 level25 level45)
(sum level21 level5 level26)
(sum level21 level11 level32)
(sum level21 level14 level35)
(sum level21 level17 level38)
(sum level21 level20 level41)
(sum level21 level25 level46)
(sum level22 level5 level27)
(sum level22 level11 level33)
(sum level22 level14 level36)
(sum level22 level17 level39)
(sum level22 level20 level42)
(sum level22 level25 level47)
(sum level23 level5 level28)
(sum level23 level11 level34)
(sum level23 level14 level37)
(sum level23 level17 level40)
(sum level23 level20 level43)
(sum level23 level25 level48)
(sum level24 level5 level29)
(sum level24 level11 level35)
(sum level24 level14 level38)
(sum level24 level17 level41)
(sum level24 level20 level44)
(sum level25 level5 level30)
(sum level25 level11 level36)
(sum level25 level14 level39)
(sum level25 level17 level42)
(sum level25 level20 level45)
(sum level26 level5 level31)
(sum level26 level11 level37)
(sum level26 level14 level40)
(sum level26 level17 level43)
(sum level26 level20 level46)
(sum level27 level5 level32)
(sum level27 level11 level38)
(sum level27 level14 level41)
(sum level27 level17 level44)
(sum level27 level20 level47)
(sum level28 level5 level33)
(sum level28 level11 level39)
(sum level28 level14 level42)
(sum level28 level17 level45)
(sum level28 level20 level48)
(sum level29 level5 level34)
(sum level29 level11 level40)
(sum level29 level14 level43)
(sum level29 level17 level46)
(sum level30 level5 level35)
(sum level30 level11 level41)
(sum level30 level14 level44)
(sum level30 level17 level47)
(sum level31 level5 level36)
(sum level31 level11 level42)
(sum level31 level14 level45)
(sum level31 level17 level48)
(sum level32 level5 level37)
(sum level32 level11 level43)
(sum level32 level14 level46)
(sum level33 level5 level38)
(sum level33 level11 level44)
(sum level33 level14 level47)
(sum level34 level5 level39)
(sum level34 level11 level45)
(sum level34 level14 level48)
(sum level35 level5 level40)
(sum level35 level11 level46)
(sum level36 level5 level41)
(sum level36 level11 level47)
(sum level37 level5 level42)
(sum level37 level11 level48)
(sum level38 level5 level43)
(sum level39 level5 level44)
(sum level40 level5 level45)
(sum level41 level5 level46)
(sum level42 level5 level47)
(sum level43 level5 level48)

(connected l0 l1)
(fuelcost level25 l0 l1)
(connected l0 l2)
(fuelcost level5 l0 l2)
(connected l0 l3)
(fuelcost level17 l0 l3)
(connected l0 l4)
(fuelcost level14 l0 l4)
(connected l1 l0)
(fuelcost level25 l1 l0)
(connected l1 l2)
(fuelcost level17 l1 l2)
(connected l2 l0)
(fuelcost level5 l2 l0)
(connected l2 l1)
(fuelcost level17 l2 l1)
(connected l2 l4)
(fuelcost level20 l2 l4)
(connected l3 l0)
(fuelcost level17 l3 l0)
(connected l3 l4)
(fuelcost level11 l3 l4)
(connected l4 l0)
(fuelcost level14 l4 l0)
(connected l4 l2)
(fuelcost level20 l4 l2)
(connected l4 l3)
(fuelcost level11 l4 l3)

(at t0 l3)
(fuel t0 level48)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l0)
)

(:goal
(and
(at p0 l3)
(at p1 l0)
(at p2 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 3
2. (drive t0 l3 l0 level31 level17 level48)
   deleted: (at t0 l3) (fuel t0 level48)
   added: (at t0 l0) (fuel t0 level31)
   goals met: 0 of 3
3. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 3
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 3
5. (drive t0 l0 l2 level26 level5 level31)
   deleted: (at t0 l0) (fuel t0 level31)
   added: (at t0 l2) (fuel t0 level26)
   goals met: 0 of 3
6. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 1 of 3
7. (drive t0 l2 l0 level21 level5 level26)
   deleted: (at t0 l2) (fuel t0 level26)
   added: (at t0 l0) (fuel t0 level21)
   goals met: 1 of 3
8. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 2 of 3
9. (drive t0 l0 l3 level4 level17 level21)
   deleted: (at t0 l0) (fuel t0 level21)
   added: (at t0 l3) (fuel t0 level4)
   goals met: 2 of 3
10. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 3 of 3
